      * PAGDCOM - COMMAREA DEL DEBITO (PAGOORD -> PAGODEB)
           05  DEB-CUENTA             PIC 9(10).
           05  DEB-TIPO               PIC X(3).
           05  DEB-MONTO              PIC S9(11)V99 COMP-3.
           05  DEB-RESP               PIC XX.
