/* Cierre diario de intereses (ficticio) */
PGM        PARM(&TASA &FECHA)
DCL        VAR(&TASA) TYPE(*DEC) LEN(5 4)
DCL        VAR(&FECHA) TYPE(*DEC) LEN(8 0)
OVRDBF     FILE(CUENTAS) TOFILE(COOPLIB/CUENTAS) +
             SHARE(*YES)
CALL       PGM(COOPLIB/CALCINT) PARM(&TASA &FECHA)
MONMSG     MSGID(CPF0000) EXEC(GOTO CMDLBL(ERROR))
SBMJOB     CMD(CALL PGM(ENVIAREP)) JOB(ENVIO)
RETURN
ERROR:     SNDPGMMSG  MSGID(CPF9898) MSGF(QCPFMSG) MSGDTA('Fallo el cierre')
ENDPGM
