*----------------------------------------------------------------------
* BANCO FICTICIO S.A. - PAGO DE ORDENES. APLICACION FICTICIA DE
* REFERENCIA DE LA PLATAFORMA NEXTI, ESCRITA PARA EL REPOSITORIO.
*----------------------------------------------------------------------
PAGOSET  DFHMSD TYPE=&SYSPARM,MODE=INOUT,LANG=COBOL,STORAGE=AUTO,      X
               TIOAPFX=YES,CTRL=(FREEKB,FRSET)
*
PAGOMEN  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1
         DFHMDF POS=(1,2),LENGTH=8,ATTRB=ASKIP,INITIAL='PAGOMEN'
         DFHMDF POS=(1,25),LENGTH=30,ATTRB=(ASKIP,BRT),INITIAL='BANCO FX
               ICTICIO - PAGOS'
FECHA    DFHMDF POS=(1,71),LENGTH=8,ATTRB=ASKIP,PICOUT='99/99/99'
         DFHMDF POS=(4,10),LENGTH=30,ATTRB=ASKIP,INITIAL='1. PAGAR UNA X
               ORDEN'
         DFHMDF POS=(5,10),LENGTH=30,ATTRB=ASKIP,INITIAL='2. CONSULTAR X
               UNA ORDEN'
         DFHMDF POS=(8,10),LENGTH=16,ATTRB=ASKIP,INITIAL='OPCION ......X
               ..:'
OPCION   DFHMDF POS=(8,27),LENGTH=1,ATTRB=(UNPROT,NUM,IC),PICIN='9',   X
               VALIDN=(MUSTFILL)
         DFHMDF POS=(8,29),LENGTH=1,ATTRB=ASKIP
MENSAJE  DFHMDF POS=(22,2),LENGTH=78,ATTRB=(ASKIP,BRT)
         DFHMDF POS=(24,2),LENGTH=40,ATTRB=ASKIP,INITIAL='ENTER=CONTINUX
               AR  PF3=SALIR'
*
PAGOORD  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1
         DFHMDF POS=(1,2),LENGTH=8,ATTRB=ASKIP,INITIAL='PAGOORD'
         DFHMDF POS=(1,25),LENGTH=30,ATTRB=(ASKIP,BRT),INITIAL='PAGO DEX
                ORDENES'
         DFHMDF POS=(4,5),LENGTH=20,ATTRB=ASKIP,INITIAL='NUMERO DE ORDEX
               N ...:'
ORDEN    DFHMDF POS=(4,26),LENGTH=7,ATTRB=(UNPROT,NUM,IC,FSET),PICIN='9X
               (7)',VALIDN=(MUSTFILL)
         DFHMDF POS=(4,34),LENGTH=1,ATTRB=ASKIP
         DFHMDF POS=(5,5),LENGTH=20,ATTRB=ASKIP,INITIAL='EMPRESA ......X
               .....:'
EMPRESA  DFHMDF POS=(5,26),LENGTH=5,ATTRB=(UNPROT,NUM),PICIN='9(5)',   X
               VALIDN=(MUSTFILL)
         DFHMDF POS=(5,32),LENGTH=1,ATTRB=ASKIP
         DFHMDF POS=(6,5),LENGTH=20,ATTRB=ASKIP,INITIAL='SERVICIO .....X
               .....:'
SERVIC   DFHMDF POS=(6,26),LENGTH=10,ATTRB=UNPROT
         DFHMDF POS=(6,37),LENGTH=1,ATTRB=ASKIP
         DFHMDF POS=(7,5),LENGTH=20,ATTRB=ASKIP,INITIAL='TIPO DE CUENTAX
                ....:'
TIPCTA   DFHMDF POS=(7,26),LENGTH=3,ATTRB=UNPROT
         DFHMDF POS=(7,30),LENGTH=1,ATTRB=ASKIP
         DFHMDF POS=(8,5),LENGTH=20,ATTRB=ASKIP,INITIAL='CUENTA .......X
               .....:'
CUENTA   DFHMDF POS=(8,26),LENGTH=10,ATTRB=(UNPROT,NUM),PICIN='9(10)'
         DFHMDF POS=(8,37),LENGTH=1,ATTRB=ASKIP
         DFHMDF POS=(9,5),LENGTH=20,ATTRB=ASKIP,INITIAL='VALOR ........X
               .....:'
VALOR    DFHMDF POS=(9,26),LENGTH=11,ATTRB=(UNPROT,NUM),PICIN='9(9)V99'
         DFHMDF POS=(9,38),LENGTH=1,ATTRB=ASKIP
         DFHMDF POS=(10,5),LENGTH=20,ATTRB=ASKIP,INITIAL='CANAL (WEB/OFX
               I) ...:'
CANAL    DFHMDF POS=(10,26),LENGTH=3,ATTRB=UNPROT,INITIAL='WEB'
         DFHMDF POS=(10,30),LENGTH=1,ATTRB=ASKIP
         DFHMDF POS=(11,5),LENGTH=20,ATTRB=ASKIP,INITIAL='CLAVE DE APROX
               BACION:'
CLAVE    DFHMDF POS=(11,26),LENGTH=6,ATTRB=(UNPROT,DRK)
         DFHMDF POS=(11,33),LENGTH=1,ATTRB=ASKIP
MENSAJE  DFHMDF POS=(22,2),LENGTH=78,ATTRB=(ASKIP,BRT)
         DFHMDF POS=(24,2),LENGTH=75,ATTRB=ASKIP,INITIAL='ENTER=PAGAR  X
               PF3=VOLVER  PF12=CANCELAR - LOS CAMPOS CON * SON OBLIGATX
               ORIOS'
*
PAGORES  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1
         DFHMDF POS=(1,2),LENGTH=8,ATTRB=ASKIP,INITIAL='PAGORES'
         DFHMDF POS=(1,25),LENGTH=30,ATTRB=(ASKIP,BRT),INITIAL='RESULTAX
               DO DEL PAGO'
         DFHMDF POS=(4,5),LENGTH=20,ATTRB=ASKIP,INITIAL='ORDEN ........X
               .....:'
RORDEN   DFHMDF POS=(4,26),LENGTH=7,ATTRB=ASKIP,PICOUT='9(7)'
         DFHMDF POS=(5,5),LENGTH=20,ATTRB=ASKIP,INITIAL='COMISION .....X
               .....:'
RCOMIS   DFHMDF POS=(5,26),LENGTH=10,ATTRB=ASKIP,PICOUT='ZZZ,ZZ9.99'
         DFHMDF POS=(6,5),LENGTH=20,ATTRB=ASKIP,INITIAL='MOVIMIENTO ...X
               .....:'
RMOVIM   DFHMDF POS=(6,26),LENGTH=10,ATTRB=ASKIP,PICOUT='Z(9)9'
         DFHMDF POS=(7,5),LENGTH=20,ATTRB=ASKIP,INITIAL='RESULTADO ....X
               .....:'
RMENS    DFHMDF POS=(7,26),LENGTH=40,ATTRB=(ASKIP,BRT)
         DFHMDF POS=(24,2),LENGTH=40,ATTRB=ASKIP,INITIAL='ENTER=NUEVO PX
               AGO  PF3=MENU'
         DFHMSD TYPE=FINAL
         END
