* PAGOS - DEFINICIONES CICS DEL GRUPO PAGOS (APLICACION FICTICIA)
 DEFINE TRANSACTION(PGMN) GROUP(PAGOS) PROGRAM(PAGOMNU)
        DESCRIPTION(MENU DE PAGOS)
 DEFINE TRANSACTION(PGOR) GROUP(PAGOS) PROGRAM(PAGOORD)
        DESCRIPTION(PAGO DE ORDENES)
 DEFINE PROGRAM(PAGOMNU) GROUP(PAGOS) LANGUAGE(COBOL)
 DEFINE PROGRAM(PAGOORD) GROUP(PAGOS) LANGUAGE(COBOL)
 DEFINE PROGRAM(PAGODEB) GROUP(PAGOS) LANGUAGE(COBOL)
 DEFINE MAPSET(PAGOSET) GROUP(PAGOS)
 DEFINE FILE(ORDENES) GROUP(PAGOS) DSNAME(BF.PAGOS.ORDENES)
        RECORDFORMAT(F) ADD(NO) BROWSE(NO) READ(YES) UPDATE(YES)
 DEFINE FILE(CUENTAS) GROUP(PAGOS) DSNAME(BF.PAGOS.CUENTAS)
        RECORDFORMAT(F) ADD(NO) BROWSE(NO) READ(YES) UPDATE(YES)
