00100A          R DETALLE                   SPACEA(1)
00200A            CTNUME    R   10A        5
00300A            WINT          11P 2     20EDTCDE(J)
